GopalSaraf/Practicals/PSDL/include/proc/pic18f24k40.h
// Generated 09/02/2023 GMT

/*
 * Copyright © 2023, Microchip Technology Inc. and its subsidiaries ("Microchip")
 * All rights reserved.
 * 
 * This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
 * 
 * Redistribution and use in source and binary forms, with or without modification, are
 * permitted provided that the following conditions are met:
 * 
 *     1. Redistributions of source code must retain the above copyright notice, this list of
 *        conditions and the following disclaimer.
 * 
 *     2. Redistributions in binary form must reproduce the above copyright notice, this list
 *        of conditions and the following disclaimer in the documentation and/or other
 *        materials provided with the distribution. Publication is not required when
 *        this file is used in an embedded application.
 * 
 *     3. Microchip's name may not be used to endorse or promote products derived from this
 *        software without specific prior written permission.
 * 
 * THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
 * INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
 * PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
 * INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
 * THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#ifndef _PIC18F24K40_H_
#define _PIC18F24K40_H_

/*
 * C Header file for the Microchip PIC Microcontroller
 * PIC18F24K40
 */
#ifndef _XC_H_
#warning Header file pic18f24k40.h included directly. Use #include <xc.h> instead.
#endif

#include <__at.h>

/*
 * Register Definitions
 */

// Register: PPSLOCK
#define PPSLOCK PPSLOCK
extern volatile unsigned char           PPSLOCK             __at(0xEA0);
#ifndef _LIB_BUILD
asm("PPSLOCK equ 0EA0h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PPSLOCKED              :1;
    };
} PPSLOCKbits_t;
extern volatile PPSLOCKbits_t PPSLOCKbits __at(0xEA0);
// bitfield macros
#define _PPSLOCK_PPSLOCKED_POSN                             0x0
#define _PPSLOCK_PPSLOCKED_POSITION                         0x0
#define _PPSLOCK_PPSLOCKED_SIZE                             0x1
#define _PPSLOCK_PPSLOCKED_LENGTH                           0x1
#define _PPSLOCK_PPSLOCKED_MASK                             0x1

// Register: INT0PPS
#define INT0PPS INT0PPS
extern volatile unsigned char           INT0PPS             __at(0xEA1);
#ifndef _LIB_BUILD
asm("INT0PPS equ 0EA1h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :1;
    };
    struct {
        unsigned INT0PPS                :4;
    };
    struct {
        unsigned INT0PPS0               :1;
        unsigned INT0PPS1               :1;
        unsigned INT0PPS2               :1;
        unsigned INT0PPS3               :1;
    };
} INT0PPSbits_t;
extern volatile INT0PPSbits_t INT0PPSbits __at(0xEA1);
// bitfield macros
#define _INT0PPS_PIN_POSN                                   0x0
#define _INT0PPS_PIN_POSITION                               0x0
#define _INT0PPS_PIN_SIZE                                   0x3
#define _INT0PPS_PIN_LENGTH                                 0x3
#define _INT0PPS_PIN_MASK                                   0x7
#define _INT0PPS_PORT_POSN                                  0x3
#define _INT0PPS_PORT_POSITION                              0x3
#define _INT0PPS_PORT_SIZE                                  0x1
#define _INT0PPS_PORT_LENGTH                                0x1
#define _INT0PPS_PORT_MASK                                  0x8
#define _INT0PPS_INT0PPS_POSN                               0x0
#define _INT0PPS_INT0PPS_POSITION                           0x0
#define _INT0PPS_INT0PPS_SIZE                               0x4
#define _INT0PPS_INT0PPS_LENGTH                             0x4
#define _INT0PPS_INT0PPS_MASK                               0xF
#define _INT0PPS_INT0PPS0_POSN                              0x0
#define _INT0PPS_INT0PPS0_POSITION                          0x0
#define _INT0PPS_INT0PPS0_SIZE                              0x1
#define _INT0PPS_INT0PPS0_LENGTH                            0x1
#define _INT0PPS_INT0PPS0_MASK                              0x1
#define _INT0PPS_INT0PPS1_POSN                              0x1
#define _INT0PPS_INT0PPS1_POSITION                          0x1
#define _INT0PPS_INT0PPS1_SIZE                              0x1
#define _INT0PPS_INT0PPS1_LENGTH                            0x1
#define _INT0PPS_INT0PPS1_MASK                              0x2
#define _INT0PPS_INT0PPS2_POSN                              0x2
#define _INT0PPS_INT0PPS2_POSITION                          0x2
#define _INT0PPS_INT0PPS2_SIZE                              0x1
#define _INT0PPS_INT0PPS2_LENGTH                            0x1
#define _INT0PPS_INT0PPS2_MASK                              0x4
#define _INT0PPS_INT0PPS3_POSN                              0x3
#define _INT0PPS_INT0PPS3_POSITION                          0x3
#define _INT0PPS_INT0PPS3_SIZE                              0x1
#define _INT0PPS_INT0PPS3_LENGTH                            0x1
#define _INT0PPS_INT0PPS3_MASK                              0x8

// Register: INT1PPS
#define INT1PPS INT1PPS
extern volatile unsigned char           INT1PPS             __at(0xEA2);
#ifndef _LIB_BUILD
asm("INT1PPS equ 0EA2h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :1;
    };
    struct {
        unsigned INT1PPS                :4;
    };
    struct {
        unsigned INT1PPS0               :1;
        unsigned INT1PPS1               :1;
        unsigned INT1PPS2               :1;
        unsigned INT1PPS3               :1;
    };
} INT1PPSbits_t;
extern volatile INT1PPSbits_t INT1PPSbits __at(0xEA2);
// bitfield macros
#define _INT1PPS_PIN_POSN                                   0x0
#define _INT1PPS_PIN_POSITION                               0x0
#define _INT1PPS_PIN_SIZE                                   0x3
#define _INT1PPS_PIN_LENGTH                                 0x3
#define _INT1PPS_PIN_MASK                                   0x7
#define _INT1PPS_PORT_POSN                                  0x3
#define _INT1PPS_PORT_POSITION                              0x3
#define _INT1PPS_PORT_SIZE                                  0x1
#define _INT1PPS_PORT_LENGTH                                0x1
#define _INT1PPS_PORT_MASK                                  0x8
#define _INT1PPS_INT1PPS_POSN                               0x0
#define _INT1PPS_INT1PPS_POSITION                           0x0
#define _INT1PPS_INT1PPS_SIZE                               0x4
#define _INT1PPS_INT1PPS_LENGTH                             0x4
#define _INT1PPS_INT1PPS_MASK                               0xF
#define _INT1PPS_INT1PPS0_POSN                              0x0
#define _INT1PPS_INT1PPS0_POSITION                          0x0
#define _INT1PPS_INT1PPS0_SIZE                              0x1
#define _INT1PPS_INT1PPS0_LENGTH                            0x1
#define _INT1PPS_INT1PPS0_MASK                              0x1
#define _INT1PPS_INT1PPS1_POSN                              0x1
#define _INT1PPS_INT1PPS1_POSITION                          0x1
#define _INT1PPS_INT1PPS1_SIZE                              0x1
#define _INT1PPS_INT1PPS1_LENGTH                            0x1
#define _INT1PPS_INT1PPS1_MASK                              0x2
#define _INT1PPS_INT1PPS2_POSN                              0x2
#define _INT1PPS_INT1PPS2_POSITION                          0x2
#define _INT1PPS_INT1PPS2_SIZE                              0x1
#define _INT1PPS_INT1PPS2_LENGTH                            0x1
#define _INT1PPS_INT1PPS2_MASK                              0x4
#define _INT1PPS_INT1PPS3_POSN                              0x3
#define _INT1PPS_INT1PPS3_POSITION                          0x3
#define _INT1PPS_INT1PPS3_SIZE                              0x1
#define _INT1PPS_INT1PPS3_LENGTH                            0x1
#define _INT1PPS_INT1PPS3_MASK                              0x8

// Register: INT2PPS
#define INT2PPS INT2PPS
extern volatile unsigned char           INT2PPS             __at(0xEA3);
#ifndef _LIB_BUILD
asm("INT2PPS equ 0EA3h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :1;
    };
    struct {
        unsigned INT2PPS                :4;
    };
    struct {
        unsigned INT2PPS0               :1;
        unsigned INT2PPS1               :1;
        unsigned INT2PPS2               :1;
        unsigned INT2PPS3               :1;
    };
} INT2PPSbits_t;
extern volatile INT2PPSbits_t INT2PPSbits __at(0xEA3);
// bitfield macros
#define _INT2PPS_PIN_POSN                                   0x0
#define _INT2PPS_PIN_POSITION                               0x0
#define _INT2PPS_PIN_SIZE                                   0x3
#define _INT2PPS_PIN_LENGTH                                 0x3
#define _INT2PPS_PIN_MASK                                   0x7
#define _INT2PPS_PORT_POSN                                  0x3
#define _INT2PPS_PORT_POSITION                              0x3
#define _INT2PPS_PORT_SIZE                                  0x1
#define _INT2PPS_PORT_LENGTH                                0x1
#define _INT2PPS_PORT_MASK                                  0x8
#define _INT2PPS_INT2PPS_POSN                               0x0
#define _INT2PPS_INT2PPS_POSITION                           0x0
#define _INT2PPS_INT2PPS_SIZE                               0x4
#define _INT2PPS_INT2PPS_LENGTH                             0x4
#define _INT2PPS_INT2PPS_MASK                               0xF
#define _INT2PPS_INT2PPS0_POSN                              0x0
#define _INT2PPS_INT2PPS0_POSITION                          0x0
#define _INT2PPS_INT2PPS0_SIZE                              0x1
#define _INT2PPS_INT2PPS0_LENGTH                            0x1
#define _INT2PPS_INT2PPS0_MASK                              0x1
#define _INT2PPS_INT2PPS1_POSN                              0x1
#define _INT2PPS_INT2PPS1_POSITION                          0x1
#define _INT2PPS_INT2PPS1_SIZE                              0x1
#define _INT2PPS_INT2PPS1_LENGTH                            0x1
#define _INT2PPS_INT2PPS1_MASK                              0x2
#define _INT2PPS_INT2PPS2_POSN                              0x2
#define _INT2PPS_INT2PPS2_POSITION                          0x2
#define _INT2PPS_INT2PPS2_SIZE                              0x1
#define _INT2PPS_INT2PPS2_LENGTH                            0x1
#define _INT2PPS_INT2PPS2_MASK                              0x4
#define _INT2PPS_INT2PPS3_POSN                              0x3
#define _INT2PPS_INT2PPS3_POSITION                          0x3
#define _INT2PPS_INT2PPS3_SIZE                              0x1
#define _INT2PPS_INT2PPS3_LENGTH                            0x1
#define _INT2PPS_INT2PPS3_MASK                              0x8

// Register: T0CKIPPS
#define T0CKIPPS T0CKIPPS
extern volatile unsigned char           T0CKIPPS            __at(0xEA4);
#ifndef _LIB_BUILD
asm("T0CKIPPS equ 0EA4h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :1;
    };
    struct {
        unsigned T0CKIPPS               :5;
    };
    struct {
        unsigned T0CKIPPS0              :1;
        unsigned T0CKIPPS1              :1;
        unsigned T0CKIPPS2              :1;
        unsigned T0CKIPPS3              :1;
    };
} T0CKIPPSbits_t;
